/* eslint-disable */
/**
 * 常用正则表达式
 */
export default {
  // 6-20位字母、数字、特殊符号任意两种组合
  passwordReg: /^(?![0-9]+$)(?![a-zA-Z]+$)(?![\^&\*\(\)~!@#\$%:"<>\?_\+\-\|\{\};',\.\/=\\\[\]`]+$)[0-9A-Za-z~?![\^&\*\(\)~!@#\$%:"<>\?_\+\-\|\{\};',\.\/=\\\[\]`]{6,20}$/,
  // 手机号
  phoneReg: /^1([38]\d|4[5-9]|5[0-35-9]|6[5-6]|7[0-8]|9[0-3,5-9])\d{8}$/,
  // 座机号
  telephoneReg: /^([0-9]{3,4}-)?[0-9]{7,8}$/,
  // 邮箱验证
  emailReg: /^[a-z0-9]+([._\\-]*[a-z0-9])*@([a-z0-9]+[-a-z0-9]*[a-z0-9]+.){1,63}[a-z0-9]+$/,
  // 数字且最多两位小数
  numReg: /^\d+(\.\d{1,2})?$/,
  // 正整数 不包含0
  intReg: /^[1-9]{1}[0-9]*$/,
  // 身份证号
  idCardReg: /(^\d{15}$)|(^\d{18}$)|(^\d{17}(\d|X|x)$)/,
  // 车牌号
  plateReg: /^(([京津沪渝冀豫云辽黑湘皖鲁新苏浙赣鄂桂甘晋蒙陕吉闽贵粤青藏川宁琼使领][A-Z](([0-9]{5}[DF])|([DF]([A-HJ-NP-Z0-9])[0-9]{4})))|([京津沪渝冀豫云辽黑湘皖鲁新苏浙赣鄂桂甘晋蒙陕吉闽贵粤青藏川宁琼使领][A-Z][A-HJ-NP-Z0-9]{4}[A-HJ-NP-Z0-9挂学警港澳使领]))$/,
  // 英文特殊字符
  specialEnReg: /[`!@#$%^&*()_+<>?:"{},.\\/;'[\]]/im,
  // 中文特殊字符
  specialCnReg: /[·！#￥（——）：；“”‘、，|《。》？、【】[\]]/im,
  // 字母和数字
  letterAndNumReg: /^[a-zA-Z0-9]*$/,
  // 地址字符集: 中文, 字母, 数字
  addressReg: /^[a-zA-Z0-9_\u4e00-\u9fa5]+$/
}
